init.org
:PROPERTIES:
:header-args: :session init :tangle init.el
:END:
#+title: Emacs Config File
#+author: Camilla A.
#+startup: overview


* Start up
So the first thing that we need is to setup ~straight.el~ instead of ~package.el~.
#+begin_src elisp
  (setq package-enable-at-startup nil)

  (defvar bootstrap-version)
  (let ((bootstrap-file
	 (expand-file-name "straight/repos/straight.el/bootstrap.el" user-emacs-directory))
	(bootstrap-version 6))
    (unless (file-exists-p bootstrap-file)
      (with-current-buffer
	  (url-retrieve-synchronously
	   "https://raw.githubusercontent.com/radian-software/straight.el/develop/install.el"
	   'silent 'inhibit-cookies)
	(goto-char (point-max))
	(eval-print-last-sexp)))
    (load bootstrap-file nil 'nomessage))
#+end_src

* Programming
** Emacs Lisp
Obvious reasons why I need to be including this.
#+begin_src elisp
  (straight-use-package 'paredit)
  (add-hook 'emacs-lisp-mode-hook #'enable-paredit-mode)
#+end_src
** Magit
#+begin_src elisp
  (straight-use-package 'magit)
#+end_src

* Misc
I want a theme.
#+begin_src elisp
  (straight-use-package 'ef-themes)
  (load-theme 'ef-cherie t)

  (tool-bar-mode -1)
  (menu-bar-mode -1)
  (scroll-bar-mode -1)

  (defalias 'yes-or-no-p 'y-o-n-p)
#+end_src
